// Получаем из DOM-дерева объект холста по идентификатору
var canvas = document.getElementById("cnv");

// Проверяем, можем ли мы с ним работать (поддерживается ли браузером, был ли вообще найден в DOM-дереве)
if (canvas && canvas.getContext) {

	// Получаем доступ к 2D-контексту холста
	var context = canvas.getContext("2d"),
	
		// Массив, по которому нужно отрисовать QR-код
		qrArray = [
			"111111100001001111111",
			"100000101000101000001",
			"101110100110001011101",
			"101110100111101011101",
			"101110101011101011101",
			"100000100101001000001",
			"111111101010101111111",
			"000000000110000000000",
			"101010100000100010010",
			"010110001001010001100",
			"001001100001000110010",
			"111110011111110000010",
			"010101100101000110111",
			"000000001010001101100",
			"111111100010100111000",
			"100000100000010101011",
			"101110101010101101111",
			"101110100011010110010",
			"101110101111001100101",
			"100000100101110001011",
			"111111101001001101101"
		];

	// Отрисовываем

	function draw(qrArray){
		var x = 10, y = 10;
		for(var i = 0; i<qrArray.length; i++) {
			for(var j =0; j<qrArray[i].length; j++) {
				if(qrArray[i].charAt(j) == 1){
					context.fillStyle = 'rgb(0,0,0)';
					context.fillRect(x,y, 10, 10);
				} else {
					context.fillStyle = 'rgb(255,255,255)';
					context.fillRect(x,y,10,10)
				}
				x= x + 10;
			}
			y= y + 10;
			x = 10;
		}
	}
	draw(qrArray);
	context.strokeStyle = 'black';
	context.stroke();
}
